In [1]:
# Import all packages needed for the assisgnment
import numpy as np
import pandas as pd 
import seaborn as sns 
import matplotlib.pyplot as plt 
%matplotlib inline
import statistics as stats
import scipy
from scipy.stats import iqr

In [2]:
salary_df = pd.read_csv('salary.csv')
#metadata = pd.read_csv('salary metadata.csv')

In [3]:
#Number of respondents
salary_df

,salary,exprior,yearsworked,yearsrank,market,degree,otherqual,position,male,Field,yearsabs
0,53000.0,0,0,0,1.17,1,0,1,1,3,0
1,58000.0,1,0,0,1.24,1,0,1,1,2,0
2,45500.0,0,0,0,1.21,1,0,1,1,3,2
3,35782.0,0,2,1,0.99,1,0,1,1,4,1
4,34731.0,0,2,2,0.91,1,0,1,1,4,1
...,...,...,...,...,...,...,...,...,...,...,...
509,45906.0,6,17,11,0.92,1,0,2,0,2,70
510,60402.0,6,19,7,0.86,1,0,3,0,1,72
511,53187.0,19,7,6,0.78,1,0,3,0,4,76
512,56542.0,8,20,10,0.78,1,0,3,0,2,78
513,52662.0,13,25,11,0.78,1,0,3,0,1,112

In [4]:
salary_df.isna().sum().sum()
#total number of null values in the data-set.

1

In [5]:
salary_df.loc[:,salary_df.isnull().any()]

      salary
0    53000.0
1    58000.0
2    45500.0
3    35782.0
4    34731.0
..       ...
509  45906.0
510  60402.0
511  53187.0
512  56542.0
513  52662.0

[514 rows x 1 columns]

In [6]:
#highest salary in group
print(salary_df[salary_df.salary == salary_df.salary.max()])

      salary  exprior  yearsworked  yearsrank  market  degree  otherqual  \
377  96156.0       20           12         12    1.19       1          0

     position  male  Field  yearsabs
377         3     1      1         2

In [7]:
#lowest salary in group
print(salary_df[salary_df.salary == salary_df.salary.min()])

     salary  exprior  yearsworked  yearsrank  market  degree  otherqual  \
79  29000.0        6            0          0    0.78       0          0

    position  male  Field  yearsabs
79         1     1      3         0

In [8]:
# mean of the salary column with standard error of the mean.
print("the mean of the salary:",salary_df.loc[:,"salary"].mean())
print("the standard error of the mean:",salary_df.loc[:,"salary"].sem().round())

the mean of the salary: 50863.22009783625
the standard error of the mean: 560.0

In [9]:
#standard deviation for the years worked
salary_df.loc[:,"yearsworked"].std()

9.444695144169803

In [10]:
# mean of the salary column
salary_df.loc[:,"salary"].mean()

50863.22009783625

In [11]:
# median of the salary column
salary_df.loc[:,"salary"].median()

50096.0

In [25]:
sal_drop = salary_df["salary"].dropna()

In [26]:
# the interquartile range for salary in the sample
print(np.percentile(sal_drop,75) - np.percentile(sal_drop,25))

20345.0

In [27]:
#number of men and women
salary_df['salary'].value_counts()

33680.00000    10
34206.00000     6
32000.00000     5
34731.00000     5
36833.00000     4
               ..
37037.00000     1
34603.00000     1
47396.00000     1
58134.00000     1
83192.23438     1
Name: salary, Length: 445, dtype: int64